---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetEmptySketch
source: html/33bc48ba-02a4-eae6-0f8a-bcd48ad2f3ac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetEmptySketch Property

The bend profile requires at least one segment to be placed in a host. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

## Syntax (C#)
```csharp
public static FailureDefinitionId BentFabricSheetEmptySketch { get; }
```